import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Name","Type","ResGUID","IsLoop","Volume","PS"],["","","","","","",""],[1001,"商店灯光show开始的音效",0,"130711",0,100,null],[1002,"商店灯光show结束的音效",0,"131607",0,100,null],[1003,"翻转马卡片的音效",0,"131831",0,100,null],[1004,"买马之后的欢呼",0,"120844",0,100,null],[1005,"按钮点击",0,"131828",0,100,null],[1006,"马场背景音乐",1,"132233",1,100,null],[1007,"赛马场背景音乐",1,"132236",1,70,null],[1008,"买马的背景音乐",1,"133051",1,70,null],[1009,"赛马场结算的背景音乐",1,"132945",0,70,"音质有问题"],[1010,"赛马场QTE背景音乐",0,"131825",1,100,null],[1011,"赛马场结算欢呼",1,"133049",0,70,null],[1012,"下雨天赛马场雨声",0,"130718",1,100,null],[1013,"繁育过程背景音乐",1,"132231",0,100,null],[1014,"繁育成功小马出生音效",0,"132235",0,100,null],[1015,"商业区街道的背景音乐",1,"132230",1,60,null],[1016,"赛马场的马蹄音效",0,"131829",1,100,"比赛马奔跑的马蹄声"],[1017,"赛马开始的倒计时音效",0,"132944",0,100,null],[1018,"数字/图标滚动音效",0,"132237",0,100,"赛马场准备界面，天气和数字轮播使用"],[1019,"结算排名出现音效",0,"131834",0,100,"配合排名依次出现"],[1020,"结算下注失败音效",0,"131840",0,100,null],[1021,"结算下注成功音效",0,"99723",0,100,null],[1022,"界面跳转/提示/变更音效",0,"130730",0,100,null],[1023,"货币音效",0,"130729",0,100,"获得或者花费货币时播放"],[1024,"对话音效",0,"130713",0,100,"文本框内文字依次弹出时播放"],[1025,"汽笛声",0,"130720",0,100,"新手轮船进入时播放"],[1026,"屎飞向人的音效",0,"39341",0,50,null],[1027,"屎飞到人身上后的音效",0,"19608",0,100,null],[1028,"卖屎时金币往外冒的音效",0,"130732",0,100,null],[1029,"提示框上划弹出音效",0,"130731",0,100,null],[1030,"马出现在人身后的跟随/马触发事件音效",0,"131836",0,100,null],[1031,"人声1",0,"131835",0,100,null],[1032,"人声2",0,"131838",0,100,null],[1033,"人声3",0,"131837",0,100,null],[1034,"人声4",0,"131839",0,100,null],[1035,"人声5",0,"131826",0,100,null],[1036,"QTE点击音效",0,"39338",0,100,null],[1037,"货币获得音效",0,"99733",0,100,null],[1038,"数字/图标滚动结束出结果音效",0,"132232",0,100,null],[1039,"5~8名嘘声",0,"132943",0,60,null],[1040,"转场音效",0,"133053",0,100,null],[1041,"冲线音效",0,"132948",0,20,"每匹马冲线时均播放一次"],[1042,"下注过程播放的BGM",1,"132949",1,70,"音质有问题"],[1043,"奶奶的信出现动画同步播放",0,"132950",0,100,null],[1044,"冲线音效-烟花",0,"132952",0,20,"和冲线音效同时播放，但循环"],[1045,"进入赛场转场音效",0,"132947",0,100,null]];
export interface IAudioElement extends IElementBase{
 	/**q_id*/
	ID:number
	/**名字*/
	Name:string
	/**undefined*/
	Type:number
	/**音频资源*/
	ResGUID:string
	/**是否循环*/
	IsLoop:number
	/**音量大小*/
	Volume:number
	/**备注*/
	PS:string
 } 
export class AudioConfig extends ConfigBase<IAudioElement>{
	constructor(){
		super(EXCELDATA);
	}

}