import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Detail","Environment","Talk","offsetPos"],["","","","",""],[1001,"被添加加速buff",1,"Horsetalk_1",[0,0,200]],[1002,"被添加减速buff",1,"Horsetalk_2",[0,0,200]],[1003,"被添加倒退",1,"Horsetalk_3",[0,0,200]],[1004,"摆烂",1,"Horsetalk_4",[0,0,200]],[1005,"提前出发",1,"Horsetalk_5",[0,0,200]],[1006,"自嗨",1,"Horsetalk_6",[0,0,200]],[1007,"大招1",1,"Horsetalk_46",[0,0,200]],[1008,"大招2",1,"Horsetalk_47",[0,0,200]],[1009,"大招3",1,"Horsetalk_48",[0,0,200]],[1010,"大招4",1,"Horsetalk_49",[0,0,200]],[1011,"大招5",1,"Horsetalk_50",[0,0,200]],[1012,"大招6",1,"Horsetalk_51",[0,0,200]],[1013,"大招7",1,"Horsetalk_52",[0,0,200]],[1014,"大招8",1,"Horsetalk_53",[0,0,200]],[1015,"大招9",1,"Horsetalk_54",[0,0,200]],[1016,"大招10",1,"Horsetalk_55",[0,0,200]],[1017,"马厩每隔X秒马匹说一句话",2,"Horsetalk_22",[0,0,200]],[1018,"马厩每隔X秒马匹说一句话",2,"Horsetalk_23",[0,0,200]],[1019,"马厩每隔X秒马匹说一句话",2,"Horsetalk_24",[0,0,200]],[1020,"马厩每隔X秒马匹说一句话",2,"Horsetalk_25",[0,0,200]],[1021,"马厩每隔X秒马匹说一句话",2,"Horsetalk_26",[0,0,200]],[1022,"马厩每隔X秒马匹说一句话",2,"Horsetalk_27",[0,0,200]],[1023,"马厩每隔X秒马匹说一句话",2,"Horsetalk_28",[0,0,200]],[1024,"马厩每隔X秒马匹说一句话",2,"Horsetalk_29",[0,0,200]],[1025,"马厩每隔X秒马匹说一句话",2,"Horsetalk_30",[0,0,200]],[1026,"马厩每隔X秒马匹说一句话",2,"Horsetalk_31",[0,0,200]],[1027,"马厩每隔X秒马匹说一句话",2,"Horsetalk_32",[0,0,200]],[1028,"马厩每隔X秒马匹说一句话",2,"Horsetalk_33",[0,0,200]],[1029,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_34",[0,0,200]],[1030,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_35",[0,0,200]],[1031,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_36",[0,0,200]],[1032,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_37",[0,0,200]],[1033,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_38",[0,0,200]],[1034,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_39",[0,0,200]],[1035,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_40",[0,0,200]],[1036,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_41",[0,0,200]],[1037,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_42",[0,0,200]],[1038,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_43",[0,0,200]],[1039,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_44",[0,0,200]],[1040,"跟随时每隔X秒马匹说一句话",3,"Horsetalk_45",[0,0,200]],[1041,"喂养",4,"Horsetalk_9",[0,0,200]],[1042,"喂养",4,"Horsetalk_10",[0,0,200]],[1043,"喂养",4,"Horsetalk_11",[0,0,200]],[1044,"喂养",4,"Horsetalk_12",[0,0,200]],[1045,"喂养",4,"Horsetalk_13",[0,0,200]],[1046,"喂养",4,"Horsetalk_14",[0,0,200]],[1047,"喂养",4,"Horsetalk_15",[0,0,200]],[1048,"喂养",4,"Horsetalk_16",[0,0,200]],[1049,"喂养",4,"Horsetalk_17",[0,0,200]],[1050,"喂养",4,"Horsetalk_18",[0,0,200]],[1051,"喂养",4,"Horsetalk_19",[0,0,200]],[1052,"喂养",4,"Horsetalk_20",[0,0,200]],[1053,"喂养",4,"Horsetalk_21",[0,0,200]]];
export interface ITalkInfoElement extends IElementBase{
 	/**id*/
	ID:number
	/**说明*/
	Detail:string
	/**使用场景*/
	Environment:number
	/**话语*/
	Talk:string
	/**位置偏移量*/
	offsetPos:Array<number>
 } 
export class TalkInfoConfig extends ConfigBase<ITalkInfoElement>{
	constructor(){
		super(EXCELDATA);
	}

}